Repository: rwsite/wp-queue
Catalog: languages/wp-queue-*.po
Languages: ru_ru

source: %d entries
ru_ru: %d записей

source: %d tasks
ru_ru: %d задач

source: (configured)
ru_ru: (настроено)

source: A background process (Worker) constantly checks the queue for new jobs.
ru_ru: Фоновый процесс (Worker) постоянно проверяет очередь на наличие новых задач.

source: A list of all active queues with their size, status (idle/pending/running/paused), and control buttons (pause/resume, clear all tasks).
ru_ru: Список всех активных очередей с их размером, статусом (бездействие/ожидание/выполнение/пауза) и кнопками управления (пауза/возобновление, очистить все задачи).

source: A plugin creates a "Job" (a task) and pushes it to the queue.
ru_ru: Плагин создает "Задачу" (Job) и помещает ее в очередь.

source: A real cron job configured on your server (Linux) that calls WordPress every minute. This is reliable and precise. Ideally, you should disable default WP-Cron and use System Cron.
ru_ru: Настоящая задача cron, настроенная на вашем сервере (Linux), которая вызывает WordPress каждую минуту. Это надежно и точно. В идеале, вы должны отключить стандартный WP-Cron и использовать системный Cron.

source: A separate table for events that are temporarily disabled.
ru_ru: Отдельная таблица для временно отключенных событий.

source: A table of all available intervals (hourly, daily, etc.) with their duration.
ru_ru: Таблица всех доступных интервалов (ежечасно, ежедневно и т.д.) с их продолжительностью.

source: About WP Queue
ru_ru: О WP Queue

source: Action completed successfully
ru_ru: Действие выполнено успешно

source: Action Scheduler
ru_ru: Планировщик действий

source: Actions
ru_ru: Действия

source: Active
ru_ru: Активный

source: Add to wp-config.php:
ru_ru: Добавить в wp-config.php:

source: ago (overdue)
ru_ru: назад (просрочено)

source: Aleksei Tikhomirov
ru_ru: Алексей Тихомиров

source: All
ru_ru: Все

source: All queues
ru_ru: Все очереди

source: All systems are healthy.
ru_ru: Все системы работают исправно.

source: Alternate Cron
ru_ru: Альтернативный Cron

source: An error occurred
ru_ru: Произошла ошибка

source: Are you sure you want to clear this queue?
ru_ru: Вы уверены, что хотите очистить эту очередь?

source: Attempts
ru_ru: Попытки

source: Author Website
ru_ru: Сайт автора

source: Available From
ru_ru: Доступно с

source: Background job processing and WP-Cron management for WordPress. Schedule tasks, manage queues, and monitor cron events.
ru_ru: Обработка фоновых задач и управление WP-Cron для WordPress. Планируйте задачи, управляйте очередями и отслеживайте cron-события.

source: Basic Usage
ru_ru: Базовое использование

source: Button to delete old log entries to avoid cluttering the database.
ru_ru: Кнопка для удаления старых записей журнала, чтобы избежать загромождения базы данных.

source: Buttons to show all entries, only completed, or only failed jobs.
ru_ru: Кнопки для показа всех записей, только завершенных или только неудачных задач.

source: By default, WordPress executes all actions during the page load request. If a plugin needs to send 100 emails or sync 500 products with an external API, the user has to wait until it finishes. This leads to slow page loads or timeouts.
ru_ru: По умолчанию WordPress выполняет все действия во время загрузки страницы. Если плагину нужно отправить 100 писем или синхронизировать 500 товаров с внешним API, пользователь должен дождаться завершения. Это приводит к медленной загрузке страниц или тайм-аутам.

source: By default, WP Queue stores jobs in the WordPress database (wp_options or custom tables). For high-performance sites, you can use Redis. Redis is an in-memory data store that is much faster than a SQL database for queue operations. It reduces load on your database and speeds up job processing.
ru_ru: По умолчанию WP Queue хранит задачи в базе данных WordPress (wp_options или пользовательские таблицы). Для сайтов с высокой производительностью вы можете использовать Redis. Redis - это хранилище данных в памяти, которое намного быстрее, чем база данных SQL для операций с очередью. Это снижает нагрузку на вашу базу данных и ускоряет обработку задач.

source: Cancel
ru_ru: Отмена

source: Cannot connect to Memcached at %s:%d - %s
ru_ru: Не удалось подключиться к Memcached на %s:%d - %s

source: Cannot connect to Redis at %s:%d - %s
ru_ru: Не удалось подключиться к Redis на %s:%d - %s

source: Check basic system requirements that affect queue stability.
ru_ru: Проверьте базовые системные требования, влияющие на стабильность очереди.

source: Check driver settings.
ru_ru: Проверьте настройки драйвера.

source: Check logs when encountering errors in background processes.
ru_ru: Проверьте журналы при возникновении ошибок в фоновых процессах.

source: Check this tab when setting up your server or debugging queue issues.
ru_ru: Проверьте эту вкладку при настройке сервера или отладке проблем с очередью.

source: Checking for disablement (DISABLE_WP_CRON), alternative cron, loopback requests.
ru_ru: Проверка отключения (DISABLE_WP_CRON), альтернативного cron, обратных запросов.

source: Checking system requirements and environment for stable queue operation.
ru_ru: Проверка системных требований и окружения для стабильной работы очереди.

source: Clear
ru_ru: Очистить

source: Clear All
ru_ru: Очистить все

source: Clear All Logs
ru_ru: Очистить все журналы

source: Clear All Queues
ru_ru: Очистить все очереди

source: Clear Logs
ru_ru: Очистить журналы

source: Clear logs
ru_ru: Очистить журналы

source: Clear old
ru_ru: Очистить старые

source: Close
ru_ru: Закрыть

source: Comparison of server time, WordPress, and GMT offset for diagnosing scheduling issues.
ru_ru: Сравнение серверного времени, WordPress и смещения GMT для диагностики проблем с планированием.

source: Completed
ru_ru: Завершено

source: Component Status
ru_ru: Статус компонента

source: Configure
ru_ru: Настроить

source: Configure automatic retries on errors:
ru_ru: Настроить автоматические повторные попытки при ошибках:

source: Configure Memcached
ru_ru: Настроить Memcached

source: Configure Redis
ru_ru: Настроить Redis

source: Configure system cron
ru_ru: Настроить системный cron

source: Connected to Memcached at %s:%d
ru_ru: Подключено к Memcached на %s:%d

source: Connected to Redis at %s:%d
ru_ru: Подключено к Redis на %s:%d

source: Create a job class and dispatch it to the queue:
ru_ru: Создайте класс задачи и отправьте его в очередь:

source: Critical for understanding why tasks are not running on time.
ru_ru: Критически важно для понимания причин, по которым задачи не выполняются вовремя.

source: Cron event paused
ru_ru: Cron-событие приостановлено

source: Cron event resumed
ru_ru: Cron-событие возобновлено

source: Cron event updated
ru_ru: Cron-событие обновлено

source: Cron Events
ru_ru: Cron-события

source: Current driver:
ru_ru: Текущий драйвер:

source: Current Memory Usage
ru_ru: Текущее использование памяти

source: Custom driver
ru_ru: Пользовательский драйвер

source: Dashboard
ru_ru: Панель управления

source: Dashboard – quick overview of queues, number of jobs and recent activity.
ru_ru: Панель управления – быстрый обзор очередей, количества задач и недавней активности.

source: Delayed Jobs
ru_ru: Отложенные задачи

source: Delete
ru_ru: Удалить

source: Delete all
ru_ru: Удалить все

source: Deletes all job execution logs
ru_ru: Удаляет все журналы выполнения задач

source: Deletes all jobs from all queues
ru_ru: Удаляет все задачи из всех очередей

source: Deletes logs older than 7 days
ru_ru: Удаляет журналы старше 7 дней

source: Description
ru_ru: Описание

source: Detailed description of the panel tabs
ru_ru: Подробное описание вкладок панели

source: Details
ru_ru: Детали

source: Developers can dispatch their own jobs to the queue, choose drivers (Database, Sync, Redis), configure retries and schedules. See the documentation and examples on GitHub for integration details.
ru_ru: Разработчики могут отправлять свои задачи в очередь, выбирать драйверы (Database, Sync, Redis), настраивать повторные попытки и расписания. См. документацию и примеры на GitHub для деталей интеграции.

source: DISABLE_WP_CRON is set to true. Background tasks will not run automatically.
ru_ru: DISABLE_WP_CRON установлен в true. Фоновые задачи не будут выполняться автоматически.

source: Disabled
ru_ru: Отключено

source: Dispatch
ru_ru: Отправить

source: Display
ru_ru: Отобразить

source: Displays a table of scheduled recurring tasks (PHP classes) registered in WP Queue: job class, execution interval, queue assignment, and next run time. Allows you to run any task manually.
ru_ru: Отображает таблицу запланированных повторяющихся задач (классы PHP), зарегистрированных в WP Queue: класс задачи, интервал выполнения, назначение очереди и время следующего запуска. Позволяет запустить любую задачу вручную.

source: Displays all registered PHP job classes with their configuration.
ru_ru: Отображает все зарегистрированные классы задач PHP с их конфигурацией.

source: Displays environment information (PHP and WordPress versions, memory limits, execution time, timezone), WP-Cron status (disabled, alternative cron, loopback checks). If Action Scheduler is installed - its statistics. Server and WordPress time.
ru_ru: Отображает информацию об окружении (версии PHP и WordPress, лимиты памяти, время выполнения, часовой пояс), статус WP-Cron (отключен, альтернативный cron, проверки обратной связи). Если установлен Action Scheduler - его статистика. Серверное и время WordPress.

source: Displays the last 200 entries by default or all completed/failed.
ru_ru: Отображает последние 200 записей по умолчанию или все завершенные/неудачные.

source: Displays the total number of tasks in different statuses (pending, running, completed, failed).
ru_ru: Отображает общее количество задач в разных статусах (ожидание, выполнение, завершено, неудача).

source: Displays when the job should run next or marks overdue jobs.
ru_ru: Отображает, когда задача должна выполняться следующей, или отмечает просроченные задачи.

source: Distribute jobs across different queues:
ru_ru: Распределите задачи по разным очередям:

source: Documentation on GitHub
ru_ru: Документация на GitHub

source: Driver
ru_ru: Драйвер

source: Driver "%s" is configured in wp-config.php, but not available. Falling back to "%s".
ru_ru: Драйвер "%s" настроен в wp-config.php, но недоступен. Переход на "%s".

source: Driver:
ru_ru: Драйвер:

source: Drivers
ru_ru: Драйверы

source: Edit
ru_ru: Редактировать

source: Edit Cron Event
ru_ru: Редактировать Cron-событие

source: Edit Schedule
ru_ru: Редактировать расписание

source: Enabled
ru_ru: Включено

source: Environment
ru_ru: Окружение

source: Error
ru_ru: Ошибка

source: Error message
ru_ru: Сообщение об ошибке

source: Errors
ru_ru: Ошибки

source: Event actions
ru_ru: Действия событий

source: Event hook, next run time, schedule (single/hourly/daily), source, arguments.
ru_ru: Хук события, время следующего запуска, расписание (однократно/ежечасно/ежедневно), источник, аргументы.

source: Event statistics
ru_ru: Статистика событий

source: Event table
ru_ru: Таблица событий

source: events
ru_ru: события

source: Events by Source
ru_ru: События по источникам

source: Every %d Minutes
ru_ru: Каждые %d минут

source: Execution time, status (completed/failed/retrying), job class, queue, error message.
ru_ru: Время выполнения, статус (завершено/неудача/повторная попытка), класс задачи, очередь, сообщение об ошибке.

source: Failed
ru_ru: Сбои и неудачи

source: Failed Actions
ru_ru: Неудачные действия

source: Failed to pause event
ru_ru: Не удалось приостановить событие

source: Failed to resume event
ru_ru: Не удалось возобновить событие

source: Failed to update event
ru_ru: Не удалось обновить событие

source: For developers
ru_ru: Для разработчиков

source: For more information:
ru_ru: Для получения дополнительной информации:

source: For Redis/Memcached to work, you need the PHP extension installed and a server available. If not, the system will automatically use the "database" driver.
ru_ru: Для работы Redis/Memcached необходимо установить PHP-расширение и иметь доступный сервер. В противном случае система автоматически использует драйвер "база данных".

source: For site administrators
ru_ru: Для администраторов сайтов

source: Forces processing of all queues
ru_ru: Принудительно обрабатывает все очереди

source: from now
ru_ru: сейчас

source: Full documentation and code examples are available on GitHub: %s.
ru_ru: Полная документация и примеры кода доступны на GitHub: %s.

source: GitHub Repository
ru_ru: Репозиторий GitHub

source: GMT Offset
ru_ru: Смещение GMT

source: Help
ru_ru: Помощь

source: History
ru_ru: История

source: History of all job executions for diagnostics and debugging.
ru_ru: История всех выполнений задач для диагностики и отладки.

source: Hook
ru_ru: Хук

source: How Queues Work
ru_ru: Как работают очереди

source: How to change the driver?
ru_ru: Как изменить драйвер?

source: Idle
ru_ru: Бездействие

source: If installed, displays version and statistics (pending/running/failed actions).
ru_ru: Если установлен, отображает версию и статистику (ожидание/выполнение/неудачные действия).

source: If you installed WP Queue because another plugin requires it, you usually do not need to configure anything here. Use these tabs mainly for monitoring and troubleshooting.
ru_ru: Если вы установили WP Queue, потому что другой плагин требует его, обычно вам не нужно ничего настраивать здесь. Используйте эти вкладки в основном для мониторинга и устранения неполадок.

source: Important:
ru_ru: Важно:

source: In Queue
ru_ru: В очереди

source: Inspect and manage WP-Cron events for WP Queue and other plugins.
ru_ru: Проверяйте и управляйте WP-Cron событиями для WP Queue и других плагинов.

source: Install: pecl install memcached
ru_ru: Установка: pecl install memcached

source: Install: pecl install redis
ru_ru: Установка: pecl install redis

source: Interval
ru_ru: Интервал

source: Job
ru_ru: Задача

source: Job Class
ru_ru: Класс задачи

source: Job class, execution interval (e.g., "hourly", "daily"), queue assignment, next run time.
ru_ru: Класс задачи, интервал выполнения (например, "ежечасно", "ежедневно"), назначение очереди, время следующего запуска.

source: Job Details
ru_ru: Детали задачи

source: Job information
ru_ru: Информация о задаче

source: Job list
ru_ru: Список задач

source: jobs
ru_ru: задачи

source: Jobs in Queue
ru_ru: Задачи в очереди

source: Log table
ru_ru: Таблица журнала

source: Logs
ru_ru: Журналы

source: Logs – history of completed and failed jobs that helps to diagnose problems.
ru_ru: Журналы – история завершенных и неудачных задач, которые помогают диагностировать проблемы.

source: Loopback
ru_ru: Обратная связь

source: Loopback issue: %s
ru_ru: Проблема обратной связи: %s

source: Loopback Request
ru_ru: Запрос обратной связи

source: Loopback request successful
ru_ru: Запрос обратной связи выполнен успешно

source: Manage queues from command line:
ru_ru: Управление очередями из командной строки:

source: Management of scheduled recurring tasks.
ru_ru: Управление запланированными повторяющимися задачами.

source: Management of WordPress system timers that trigger background processes.
ru_ru: Управление системными таймерами WordPress, которые запускают фоновые процессы.

source: Manual run
ru_ru: Ручной запуск

source: Max Execution Time
ru_ru: Максимальное время выполнения

source: Memory Limit
ru_ru: Лимит памяти

source: Memory usage is above 80%.
ru_ru: Использование памяти выше 80%.

source: Message
ru_ru: Сообщение

source: Monitor which background jobs are queued and running right now.
ru_ru: Отслеживайте, какие фоновые задачи находятся в очереди и выполняются прямо сейчас.

source: More documentation
ru_ru: Дополнительная документация

source: Name
ru_ru: Имя

source: Named Queues
ru_ru: Именованные очереди

source: Next Run
ru_ru: Следующий запуск

source: Next run status
ru_ru: Статус следующего запуска

source: No activity
ru_ru: Нет активности

source: No cron events found.
ru_ru: Cron-события не найдены.

source: No errors
ru_ru: Нет ошибок

source: No extension
ru_ru: Нет расширения

source: No logs found
ru_ru: Журналы не найдены

source: No paused events
ru_ru: Нет приостановленных событий

source: No scheduled events
ru_ru: Нет запланированных событий

source: No scheduled jobs found.
ru_ru: Запланированные задачи не найдены.

source: No server
ru_ru: Нет сервера

source: Notifications of critical issues (low memory, disabled WP-Cron).
ru_ru: Уведомления о критических проблемах (низкая память, отключенный WP-Cron).

source: Now
ru_ru: Сейчас

source: Number of entries
ru_ru: Количество записей

source: OK
ru_ru: ОК

source: One-time
ru_ru: Однократно

source: Overdue
ru_ru: Просрочено

source: Overview
ru_ru: Обзор

source: Pause
ru_ru: Приостановить

source: Pause this queue?
ru_ru: Приостановить эту очередь?

source: Paused
ru_ru: Приостановлено

source: Paused At
ru_ru: Приостановлено в

source: Paused Events
ru_ru: Приостановленные события

source: Paused events
ru_ru: Приостановленные события

source: Paused Since
ru_ru: Приостановлено с

source: Pending
ru_ru: Ожидание

source: Pending Actions
ru_ru: Ожидающие действия

source: PHP and WordPress versions, memory limits (current usage), maximum execution time, timezone.
ru_ru: Версии PHP и WordPress, лимиты памяти (текущее использование), максимальное время выполнения, часовой пояс.

source: PHP extension "memcached" is not installed
ru_ru: PHP-расширение "memcached" не установлено

source: PHP extension "redis" (phpredis) is not installed
ru_ru: PHP-расширение "redis" (phpredis) не установлено

source: PHP max_execution_time is less than 30 seconds.
ru_ru: PHP max_execution_time меньше 30 секунд.

source: PHP Version
ru_ru: Версия PHP

source: Plugins
ru_ru: Плагины

source: Process
ru_ru: Обработать

source: Process Now
ru_ru: Обработать сейчас

source: Process Queues
ru_ru: Обработать очереди

source: Processing
ru_ru: Обработка

source: Queue
ru_ru: Очередь

source: Queue Driver
ru_ru: Драйвер очереди

source: Queue is empty
ru_ru: Очередь пуста

source: Queue statistics
ru_ru: Статистика очереди

source: Queue table
ru_ru: Таблица очереди

source: Queue: %s
ru_ru: Очередь: %s

source: Queues
ru_ru: Очереди

source: Quick Start
ru_ru: Быстрый старт

source: Quickly see if any jobs are failing and view recent log entries.
ru_ru: Быстро проверьте, не завершаются ли задачи неудачей, и просмотрите недавние записи журнала.

source: Ready
ru_ru: Готово

source: Recent Activity
ru_ru: Недавняя активность

source: Recent activity
ru_ru: Недавняя активность

source: Redis Support
ru_ru: Поддержка Redis

source: Registered Schedules
ru_ru: Зарегистрированные расписания

source: Registered schedules
ru_ru: Зарегистрированные расписания

source: Report an Issue
ru_ru: Сообщить о проблеме

source: Report Issues
ru_ru: Сообщить о проблемах

source: Resume
ru_ru: Возобновить

source: Retry Attempts
ru_ru: Попытки повтора

source: Run
ru_ru: Запустить

source: Run Now
ru_ru: Запустить сейчас

source: Run now, edit schedule, pause, delete. Modal window for changing interval.
ru_ru: Запустить сейчас, редактировать расписание, приостановить, удалить. Модальное окно для изменения интервала.

source: Run tasks on schedule:
ru_ru: Выполнять задачи по расписанию:

source: Running
ru_ru: Выполняется

source: Running Actions
ru_ru: Выполняющиеся действия

source: Save Changes
ru_ru: Сохранить изменения

source: Schedule
ru_ru: Расписание

source: Schedule a job to run after a specific time:
ru_ru: Запланировать выполнение задачи после определенного времени:

source: Scheduled
ru_ru: Запланировано

source: Scheduled Jobs
ru_ru: Запланированные задачи

source: Scheduled Jobs – list of recurring background jobs added by your theme or plugins.
ru_ru: Запланированные задачи – список повторяющихся фоновых задач, добавленных вашей темой или плагинами.

source: Scheduler
ru_ru: Планировщик

source: Server Time
ru_ru: Серверное время

source: Server time
ru_ru: Серверное время

source: Single
ru_ru: Одиночный

source: Single (run once)
ru_ru: Одиночный (выполнить один раз)

source: Source
ru_ru: Источник

source: Status
ru_ru: Статус

source: Status filters
ru_ru: Фильтры статуса

source: Storage
ru_ru: Хранилище

source: Synchronous execution (no queue)
ru_ru: Синхронное выполнение (без очереди)

source: System
ru_ru: Система

source: System Cron (Recommended)
ru_ru: Системный Cron (Рекомендуется)

source: System health
ru_ru: Системное здоровье

source: System Issues Detected:
ru_ru: Обнаружены системные проблемы:

source: System Status
ru_ru: Системный статус

source: System – checks PHP version, WP-Cron status and other important settings.
ru_ru: Система – проверяет версию PHP, статус WP-Cron и другие важные настройки.

source: The "Run Now" button allows you to run any job immediately, without waiting for the schedule.
ru_ru: Кнопка "Запустить сейчас" позволяет запустить любую задачу немедленно, без ожидания расписания.

source: The job is saved in the database (or Redis) waiting to be picked up.
ru_ru: Задача сохраняется в базе данных (или Redis) в ожидании обработки.

source: The last 10 log entries for quick tracking of queue activity.
ru_ru: Последние 10 записей журнала для быстрого отслеживания активности очереди.

source: The main tab for monitoring queue status in real-time.
ru_ru: Основная вкладка для мониторинга статуса очереди в реальном времени.

source: The plugin itself does not add new features to the frontend. It provides a reliable queue that other plugins or your custom code can use for background work.
ru_ru: Сам плагин не добавляет новые функции на фронтенд. Он предоставляет надежную очередь, которую другие плагины или ваш кастомный код могут использовать для фоновой работы.

source: The worker picks up the job and executes it. If it succeeds, it is marked as "Completed". If it fails, it can be retried.
ru_ru: Рабочий процесс забирает задачу и выполняет ее. В случае успеха она отмечается как "Завершено". В случае неудачи ее можно повторить.

source: This section is under development.
ru_ru: Этот раздел находится в разработке.

source: Time
ru_ru: Время

source: Timeout
ru_ru: Тайм-аут

source: Timezone
ru_ru: Часовой пояс

source: To add your own background jobs, use the WP Queue PHP API from your plugin or theme. You can dispatch jobs to different queues, set delays and retries. Full code examples are available in the <a href="%s" target="_blank">README on GitHub</a>.
ru_ru: Чтобы добавить свои фоновые задачи, используйте PHP API WP Queue из вашего плагина или темы. Вы можете отправлять задачи в разные очереди, устанавливать задержки и повторные попытки. Полные примеры кода доступны в <a href="%s" target="_blank">README на GitHub</a>.

source: to get a list of available commands.
ru_ru: чтобы получить список доступных команд.

source: To process the queue, WordPress needs a trigger. There are two ways to do this:
ru_ru: Для обработки очереди WordPress нужен триггер. Есть два способа это сделать:

source: Tools
ru_ru: Инструменты

source: Total
ru_ru: Всего

source: Total errors
ru_ru: Всего ошибок

source: Total Events
ru_ru: Всего событий

source: Total Jobs
ru_ru: Всего задач

source: Total number of events, overdue, grouped by source (WordPress, WooCommerce, WP Queue, plugins).
ru_ru: Общее количество событий, просроченных, сгруппированных по источнику (WordPress, WooCommerce, WP Queue, плагины).

source: Unavailable
ru_ru: Недоступно

source: Unexpected response code: %d
ru_ru: Неожиданный код ответа: %d

source: Unknown
ru_ru: Неизвестно

source: Unknown driver
ru_ru: Неизвестный драйвер

source: Upcoming Events
ru_ru: Предстоящие события

source: Usage
ru_ru: Использование

source: Use system cron
ru_ru: Использовать системный cron
