Repository: rwsite/wp-queue
Catalog: languages/wp-queue-*.po
Languages: ru_ru

source: Use this tab for quick checks of queue performance and identifying stuck processes.
ru_ru: Используйте эту вкладку для быстрой проверки производительности очереди и выявления зависших процессов.

source: Used
ru_ru: Использовано

source: Useful for testing jobs and forcing synchronizations.
ru_ru: Полезно для тестирования задач и принудительных синхронизаций.

source: Useful Links
ru_ru: Полезные ссылки

source: Uses wp_options table
ru_ru: Использует таблицу wp_options

source: Version
ru_ru: Версия

source: Versions
ru_ru: Версии

source: Warning
ru_ru: Предупреждение

source: What you can use it for
ru_ru: Для чего это можно использовать

source: Why is it needed?
ru_ru: Зачем это нужно?

source: WordPress checks for scheduled tasks on every page load. This works out of the box but has downsides: on low-traffic sites, tasks might not run on time; on high-traffic sites, it can cause performance issues. It is "fake" cron.
ru_ru: WordPress проверяет запланированные задачи при каждой загрузке страницы. Это работает из коробки, но имеет недостатки: на сайтах с низким трафиком задачи могут не выполняться вовремя; на сайтах с высоким трафиком это может вызывать проблемы с производительностью. Это "поддельный" cron.

source: WordPress Time
ru_ru: Время WordPress

source: WordPress Version
ru_ru: Версия WordPress

source: Worker
ru_ru: Рабочий процесс

source: WP Queue allows executing tasks asynchronously in the background without blocking the main WordPress execution flow.
ru_ru: WP Queue позволяет выполнять задачи асинхронно в фоне без блокировки основного потока выполнения WordPress.

source: WP Queue helps your site run heavy or regular tasks in the background (emails, synchronizations, cleanups) so that pages load faster for visitors.
ru_ru: WP Queue помогает вашему сайту выполнять тяжелые или регулярные задачи в фоновом режиме (отправка писем, синхронизации, очистка), чтобы страницы загружались быстрее для посетителей.

source: WP Queue is a robust background processing library for WordPress. It allows you to offload time-consuming tasks (like sending emails, syncing data, or generating reports) to be processed asynchronously, ensuring your site remains fast and responsive for visitors.
ru_ru: WP Queue - это надежная библиотека фоновой обработки для WordPress. Она позволяет вам выгружать трудоемкие задачи (например, отправку писем, синхронизацию данных или генерацию отчетов) для асинхронной обработки, обеспечивая быструю и отзывчивую работу сайта для посетителей.

source: WP Queue solves this by pushing these tasks to a "Queue" and processing them later in the background. The user gets an instant response, and the heavy work happens behind the scenes.
ru_ru: WP Queue решает эту проблему, помещая эти задачи в "Очередь" и обрабатывая их позже в фоновом режиме. Пользователь получает мгновенный ответ, а тяжелая работа происходит за кулисами.

source: WP Queue — Queue System for WordPress
ru_ru: WP Queue — Система очередей для WordPress

source: WP-CLI Commands
ru_ru: Команды WP-CLI

source: WP-CLI команды
ru_ru: Команды WP-CLI

source: WP-Cron (Default)
ru_ru: WP-Cron (По умолчанию)

source: WP-Cron Disabled
ru_ru: WP-Cron отключен

source: WP-Cron is disabled. Background tasks may not run automatically.
ru_ru: WP-Cron отключен. Фоновые задачи могут не выполняться автоматически.

source: WP-Cron Status
ru_ru: Статус WP-Cron

source: WP-Cron status
ru_ru: Статус WP-Cron

source: WP-Cron vs System Cron
ru_ru: WP-Cron против системного Cron

source: WP-Cron – list of cron events with the ability to run, pause or delete them.
ru_ru: WP-Cron – список cron-событий с возможностью запуска, приостановки или удаления.

source: ⚠️ Warning:
ru_ru: ⚠️ Предупреждение:
